tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendAppStyles() {
    Esp32BaseWeb::sendChunk("<style>"
                            "body{background:#f4f7f6;color:#202428;max-width:1080px;padding:10px 14px 14px;line-height:1.45;font-size:14px}"
                            "h1{color:#111;font-size:1rem;font-weight:400;margin:0 0 10px}"
                            "h2{font-size:.98rem;font-weight:400;margin:0 0 10px;color:#111}"
                            "h3{font-size:.94rem;font-weight:400;margin:0;color:#111}"
                            "p{margin:5px 0}"
                            "strong,b,th{font-weight:400}"
                            "nav{display:flex;align-items:center;gap:5px;margin:0 0 12px;padding:10px 12px;background:#fff;border:1px solid #e1e7e5;border-radius:8px;box-shadow:0 1px 2px rgba(21,35,34,.04);overflow-x:auto}"
                            "nav a{display:inline-flex;align-items:center;min-height:34px;padding:0 11px;margin:0;background:transparent;color:#2f3947;border-radius:9px;text-decoration:none;font-size:.98rem;font-weight:600;white-space:nowrap}"
                            "nav a.brand{background:transparent;color:#2f3947}"
                            "nav a.active{background:#e9f3ef;color:#226b5f}"
                            "a,button,input[type=submit],input[type=button]{border-radius:4px;box-shadow:none}"
                            "a{background:transparent;color:#2d6f7a;padding:0;margin:0;text-decoration:none}"
                            "button,input[type=submit],input[type=button]{display:inline-flex;align-items:center;justify-content:center;min-height:34px;padding:0 14px;background:#2f6f73;border:1px solid #2f6f73;color:#fff;cursor:pointer;font-size:.92rem;line-height:1.2;box-sizing:border-box;vertical-align:middle}"
                            ".faucet-actions{display:flex;flex-wrap:wrap;gap:5px;margin:0 0 10px}"
                            ".faucet-actions a{display:inline-flex;align-items:center;min-height:28px;line-height:1.2;margin:0;white-space:nowrap}"
                            "input:not([type]),input[type=text],input[type=password],input[type=number],input[type=email],input[type=url],input[type=tel],input[type=search],input[type=date],select{width:100%;height:30px;padding:4px 8px;margin:0;border:1px solid #d7dde2;border-radius:4px;box-sizing:border-box;background:#fbfcfc;color:#202428;font-size:.94rem}"
                            "select{margin:0}"
                            ".panel{border:1px solid #e1e7e5;border-radius:8px;padding:8px 10px;margin:0 0 8px;background:#fff;box-shadow:0 1px 2px rgba(21,35,34,.04)}"
                            ".panel h3{padding-bottom:6px;margin-bottom:7px;border-bottom:1px solid #edf0f2}"
                            ".panel-head{display:flex;align-items:center;justify-content:space-between;gap:8px;margin-bottom:7px;padding-bottom:6px;border-bottom:1px solid #edf0f2}"
                            ".panel-head h3{padding:0;margin:0;border:0}"
                            ".grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(160px,1fr));gap:7px 10px}"
                            ".form-grid{display:grid;grid-template-columns:repeat(12,1fr);gap:9px 12px;align-items:start}"
                            ".span-2{grid-column:span 2}.span-3{grid-column:span 3}.span-4{grid-column:span 4}.span-5{grid-column:span 5}.span-6{grid-column:span 6}.span-8{grid-column:span 8}.span-12{grid-column:1/-1}"
                            ".field{display:block;margin:0}"
                            ".field span{display:block;font-size:.82em;color:#56616b;margin-bottom:3px}"
                            ".field input{margin:0}"
                            ".hint{display:block;color:#69727a;font-size:.76em;margin:2px 0 0}"
                            ".status-pill{display:inline-block;padding:1px 7px;border-radius:999px;background:#f2f5f4;color:#4c565d;font-size:.76rem;line-height:1.35;white-space:nowrap}"
                            ".muted{color:#69727a}"
                            ".metric-grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(140px,1fr));gap:7px;margin:0 0 10px}"
                            ".metric-card{background:#fff;border:1px solid #e1e7e5;border-radius:8px;padding:7px 9px;box-shadow:0 1px 2px rgba(21,35,34,.04)}"
                            ".metric-card span{display:block;color:#69727a;font-size:.8rem;margin-bottom:2px}"
                            ".metric-card strong{display:block;color:#202428;font-size:.94rem;line-height:1.3}"
                            ".stats-layout{display:grid;grid-template-columns:minmax(0,1fr) minmax(240px,.75fr);gap:10px;align-items:start}"
                            ".stat-bars{background:#fff;border:1px solid #e1e7e5;border-radius:8px;padding:10px;box-shadow:0 1px 2px rgba(21,35,34,.04)}"
                            ".stat-bar{margin:0 0 10px}.stat-bar:last-child{margin-bottom:0}"
                            ".stat-bar-head{display:flex;align-items:center;justify-content:space-between;gap:10px;margin-bottom:4px;color:#56616b;font-size:.86rem}"
                            ".stat-bar-head strong{color:#202428}"
                            ".filter-cards{display:grid;grid-template-columns:repeat(auto-fit,minmax(220px,1fr));gap:8px;margin:0 0 10px}"
                            ".filter-card{background:#fff;border:1px solid #e1e7e5;border-radius:8px;padding:8px 10px;box-shadow:0 1px 2px rgba(21,35,34,.04)}"
                            ".filter-head{display:flex;align-items:center;justify-content:space-between;gap:8px;margin-bottom:6px}"
                            ".filter-head strong{color:#111}"
                            ".filter-meta{display:grid;grid-template-columns:1fr 1fr;gap:3px 8px;color:#56616b;font-size:.82rem;margin-top:6px}"
                            ".progress{height:5px;background:#e4e9ed;border-radius:999px;overflow:hidden}"
                            ".progress span{display:block;height:100%;background:#4f8a86;border-radius:999px}"
                            ".check-field{display:block;margin:0}"
                            ".check-title{display:block;font-size:.82em;color:#56616b;margin-bottom:3px}"
                            ".check-line{display:inline-flex;align-items:center;gap:6px;min-height:28px;padding:0 8px;border:1px solid #d7dde2;border-radius:4px;background:#fff;box-sizing:border-box;color:#202428;font-size:.92rem;white-space:nowrap}"
                            ".check-line input[type=checkbox]{margin:0;flex:0 0 auto}"
                            ".form-actions{display:flex;align-items:center;justify-content:flex-start;gap:6px;margin-top:8px;flex-wrap:wrap}"
                            ".form-actions form{margin:0}"
                            "form input[type=submit]{min-height:34px;padding:0 14px;margin:0;font-size:.92rem;line-height:1.2}"
                            ".form-actions a,.btn-link{display:inline-flex;align-items:center;justify-content:center;min-height:34px;padding:0 12px;border:1px solid #d7dde2;border-radius:4px;background:#f7f9fa;color:#355e66;font-size:.92rem;line-height:1.2;box-sizing:border-box}"
                            ".form-actions input.secondary{background:#f7f9fa;border-color:#d7dde2;color:#4c565d}"
                            ".compact-table td,.compact-table th{padding:6px 8px}"
                            ".filters-table th:first-child{width:22%}.filters-table th:last-child{width:150px}"
                            ".row-actions{display:flex;gap:5px;align-items:center;justify-content:flex-start;flex-wrap:wrap}"
                            ".row-actions a,.row-actions input[type=submit]{display:inline-flex;align-items:center;justify-content:center;min-width:48px;min-height:30px;padding:0 10px;border:1px solid #d7dde2;border-radius:4px;background:#f7f9fa;color:#355e66;font-size:.86rem;box-sizing:border-box}"
                            "table{width:100%;border-collapse:collapse;margin:0 0 10px;background:#fff;border:1px solid #e1e7e5;border-radius:8px;overflow:hidden;font-size:.92rem;box-shadow:0 1px 2px rgba(21,35,34,.04)}"
                            "td,th{padding:5px 8px;border-bottom:1px solid #edf0f2;text-align:left;vertical-align:middle}"
                            "th{background:#fafafa;color:#56616b}"
                            "tr:last-child td{border-bottom:0}"
                            "td .form-actions{margin-top:0;gap:5px;flex-wrap:nowrap}"
                            "td .form-actions a,td .form-actions input[type=submit]{min-height:30px;padding:0 10px;font-size:.86rem}"
                            ".pager{display:flex;align-items:center;justify-content:space-between;gap:10px;flex-wrap:wrap;margin:0 0 8px}"
                            ".pager-links{display:flex;align-items:center;gap:5px;flex-wrap:wrap}"
                            ".page-link,.page-current{display:inline-flex;align-items:center;justify-content:center;min-height:30px;padding:0 10px;border:1px solid #d7dde2;border-radius:4px;background:#fff;color:#355e66;font-size:.88rem;box-sizing:border-box}"
                            ".page-current{background:#e9f3ef;color:#226b5f;border-color:#cfe4dc}"
                            ".page-disabled{color:#9aa3aa;background:#f4f6f6;pointer-events:none}"
                            ".page-size{display:flex;align-items:center;gap:6px;color:#56616b;font-size:.86rem}.page-size select{width:auto;min-width:80px}"
                            ".kv{margin:0 0 10px;background:#fff;border:1px solid #e1e7e5;border-radius:8px;box-shadow:0 1px 2px rgba(21,35,34,.04);overflow:hidden}"
                            ".kv th,.kv td{padding:5px 8px;border-bottom:1px solid #edf0f2}.kv th{width:26%;color:#56616b;background:#fbfcfc}"
                            "form[action^='/esp32base'],#f,details,pre{background:#fff;border:1px solid #e1e7e5;border-radius:8px;padding:8px 10px;margin:0 0 8px;box-shadow:0 1px 2px rgba(21,35,34,.04)}"
                            "form[action^='/esp32base'] input:not([type]),form[action^='/esp32base'] input[type=text],form[action^='/esp32base'] input[type=password],#f input:not([type]){margin:3px 0 7px}"
                            "input[type=file]{margin:3px 8px 7px 0;font-size:.9rem}"
                            "body>h3{background:#fff;border:1px solid #e1e7e5;border-bottom:0;border-radius:8px 8px 0 0;padding:8px 10px;margin:8px 0 0;box-shadow:0 1px 2px rgba(21,35,34,.04)}"
                            "body>h3+p{background:#fff;border-left:1px solid #e1e7e5;border-right:1px solid #e1e7e5;margin:0;padding:0 10px 6px}"
                            "body>h3+p+form[action^='/esp32base/tools']{border-top:0;border-radius:0 0 8px 8px;margin-top:0}"
                            ".ok,.err{display:block;background:#fff;border:1px solid #e1e7e5;border-radius:8px;padding:6px 10px;margin:0 0 8px;box-shadow:0 1px 2px rgba(21,35,34,.04)}"
                            ".footerbar{margin-top:10px;padding:6px 10px;background:#fff;border:1px solid #e1e7e5;border-radius:8px;box-shadow:0 1px 2px rgba(21,35,34,.04)}"
                            "@media(max-width:720px){.stats-layout{grid-template-columns:1fr}.form-grid{grid-template-columns:1fr}.span-2,.span-3,.span-4,.span-5,.span-6,.span-8,.span-12{grid-column:1/-1}}"
                            "@media(max-width:520px){body{padding:8px 10px 12px}nav{padding:8px 10px}.grid,.metric-grid,.filter-cards{grid-template-columns:1fr}.panel{padding:8px}.form-actions{gap:5px}.kv th{width:34%}.pager{align-items:flex-start}.page-size{width:100%}}"
                            "</style>");
}

bool sendPageStart(const char* title) {
    if (!Esp32BaseWeb::checkAuth()) {
        return false;
    }
    Esp32BaseWeb::sendHeader(title);
    return true;
}

void sendPageEnd() {
    Esp32BaseWeb::sendFooter();
}

const char* stateText(WaterState state) {
    switch (state) {
        case WaterState::Idle:
            return "待机";
        case WaterState::Confirm:
            return "确认";
        case WaterState::Running:
            return "出水中";
        case WaterState::Paused:
            return "暂停";
        case WaterState::Error:
            return "异常";
    }
    return "未知";
}

const char* modeText(WaterMode mode) {
    switch (mode) {
        case WaterMode::Volume:
            return "容量";
        case WaterMode::Time:
            return "时间";
        case WaterMode::Calibration:
            return "校准";
    }
    return "未知";
}

const char* resultText(WaterResult result) {
    switch (result) {
        case WaterResult::Completed:
            return "完成";
        case WaterResult::StoppedByUser:
            return "手动停止";
        case WaterResult::SafetyStopped:
            return "安全停止";
        case WaterResult::FlowError:
            return "流量异常";
        case WaterResult::PauseTimeout:
            return "暂停超时";
    }
    return "未知";
}

void sendTextInput(const char* label, const char* name, unsigned long value) {
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'></label>", label, name, value);
}

void sendVolumeInput(const char* label, const char* name, std::uint32_t value) {
    char liters[24]{};
    formatLiters(value, liters, sizeof(liters));
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'><small class='hint'>当前 %s</small></label>",
            label,
            name,
            static_cast<unsigned long>(value),
            liters);
}

void sendMonthInput(const char* label, const char* name, std::uint32_t days) {
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'><small class='hint'>按 30 天/月计算</small></label>",
            label,
            name,
            static_cast<unsigned long>(daysToMonths(days)));
}

